server/app/controllers/clients_controller.rb

  def create
    client = Client.new(client_params)
    client.account_id = current_tenant.id
    if client.save
---
INSERT INTO "clients" ("name", "email", "phone_number", "address", "created_at", "updated_at", "account_id") VALUES (?, ?, ?, ?, ?, ?, ?)