server/app/controllers/invoices_controller.rb

SELECT "invoice_lines".* FROM "invoice_lines" WHERE "invoice_lines"."invoice_id" IN (1, 2, 3)
---
  def index
    invoices = current_tenant.invoices.includes(:invoice_lines)

INSERT INTO "invoices" ("account_id", "invoice_date", "client_id", "currency_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["account_id", 1], ["invoice_date", 2016-12-30 01:26:20 UTC], ["client_id", 1], ["currency_id", 1], ["created_at", 2016-12-26 17:04:20 UTC], ["updated_at", 2016-12-26 17:04:20 UTC]]
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."account_id" = ? AND "invoices"."id" = ? LIMIT ?  [["account_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def create
    attrs = invoice_params.merge(account_id: current_tenant.id)
    invoice_presenter = InvoicePresenter.new(attrs)
    if invoice_presenter.valid?
      invoice_id = invoice_presenter.save
      created_invoice = current_tenant.invoices.find(invoice_id)