server/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "product_type", "reorder_level", "can_be_sold", "can_be_purchased", "created_at", "updated_at", "account_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    product = Product.new(product_params)
    product.account_id = current_tenant.id
    if product.save