server/app/controllers/taxes_controller.rb

INSERT INTO "taxes" ("name", "description", "amount", "created_at", "updated_at", "account_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    tax = Tax.new(tax_params)
    tax.account_id = current_tenant.id
    if tax.save